Ran Apply for project: `environments` dir: `environments/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_vpc.eks_vpc: Refreshing state... [id=vpc-0dd6972bfe4c3b518]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-01eeb0a9043b47347]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ce48bcfbdfd323b4]
aws_route_table.public_route: Refreshing state... [id=rtb-05dcc8880ea8e976c]
aws_security_group.default_group: Refreshing state... [id=sg-0d894644a9951d1e0]
aws_route_table.private_route: Refreshing state... [id=rtb-07b5fcc7598794d5d]
aws_route.public_igw: Refreshing state... [id=r-rtb-05dcc8880ea8e976c1080289494]
aws_security_group_rule.default_egress_rule: Refreshing state... [id=sgrule-1400488733]
aws_security_group_rule.ing_http_rules: Refreshing state... [id=sgrule-2987789509]
aws_security_group_rule.ing_ssh_rules: Refreshing state... [id=sgrule-77353328]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_nat_gateway.nat_gw will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = "eipalloc-01eeb0a9043b47347"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "Test-Dev-nat-gw"
        }
      + tags_all             = {
          + "Name" = "Test-Dev-nat-gw"
        }
    }

  # aws_route.private_nat will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-07b5fcc7598794d5d"
      + state                  = (known after apply)
    }

  # aws_route_table_association.private_assoc[0] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = "rtb-07b5fcc7598794d5d"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_assoc[1] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = "rtb-07b5fcc7598794d5d"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_assoc[0] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = "rtb-05dcc8880ea8e976c"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_assoc[1] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = "rtb-05dcc8880ea8e976c"
      + subnet_id      = (known after apply)
    }

  # aws_subnet.eks_private_subnets[0] will be created
  + resource "aws_subnet" "eks_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-private-subnet-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-private-subnet-us-east-1a"
        }
      + vpc_id                                         = "vpc-0dd6972bfe4c3b518"
    }

  # aws_subnet.eks_private_subnets[1] will be created
  + resource "aws_subnet" "eks_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-private-subnet-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-private-subnet-us-east-1b"
        }
      + vpc_id                                         = "vpc-0dd6972bfe4c3b518"
    }

  # aws_subnet.eks_public_subnets[0] will be created
  + resource "aws_subnet" "eks_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-public-subnet-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-public-subnet-us-east-1a"
        }
      + vpc_id                                         = "vpc-0dd6972bfe4c3b518"
    }

  # aws_subnet.eks_public_subnets[1] will be created
  + resource "aws_subnet" "eks_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-public-subnet-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-public-subnet-us-east-1b"
        }
      + vpc_id                                         = "vpc-0dd6972bfe4c3b518"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
aws_subnet.eks_public_subnets[1]: Creating...
aws_subnet.eks_private_subnets[0]: Creating...
aws_subnet.eks_public_subnets[0]: Creating...
aws_subnet.eks_private_subnets[1]: Creating...
aws_subnet.eks_private_subnets[1]: Creation complete after 0s [id=subnet-03a4336653c6cc2fc]
aws_subnet.eks_private_subnets[0]: Creation complete after 2s [id=subnet-07deae409914e7b5e]
aws_route_table_association.private_assoc[1]: Creating...
aws_route_table_association.private_assoc[0]: Creating...
aws_route_table_association.private_assoc[0]: Creation complete after 0s [id=rtbassoc-045735d59ee851a1d]
aws_subnet.eks_public_subnets[1]: Still creating... [10s elapsed]
aws_subnet.eks_public_subnets[0]: Still creating... [10s elapsed]
aws_route_table_association.private_assoc[1]: Still creating... [10s elapsed]
aws_subnet.eks_public_subnets[1]: Creation complete after 12s [id=subnet-0a1b6f266c26de19e]
aws_subnet.eks_public_subnets[0]: Creation complete after 12s [id=subnet-0605dfc6c6acd9deb]
aws_nat_gateway.nat_gw: Creating...
aws_route_table_association.public_assoc[0]: Creating...
aws_route_table_association.public_assoc[1]: Creating...
aws_route_table_association.public_assoc[0]: Creation complete after 0s [id=rtbassoc-009f6f7f1f61d5d7d]
aws_route_table_association.public_assoc[1]: Creation complete after 1s [id=rtbassoc-0da173501a8c2fae0]
aws_route_table_association.private_assoc[1]: Creation complete after 13s [id=rtbassoc-0e6b2d11800f15741]
aws_nat_gateway.nat_gw: Still creating... [10s elapsed]
aws_nat_gateway.nat_gw: Still creating... [20s elapsed]
aws_nat_gateway.nat_gw: Still creating... [30s elapsed]
aws_nat_gateway.nat_gw: Still creating... [40s elapsed]
aws_nat_gateway.nat_gw: Still creating... [50s elapsed]
aws_nat_gateway.nat_gw: Still creating... [1m0s elapsed]
aws_nat_gateway.nat_gw: Still creating... [1m10s elapsed]
aws_nat_gateway.nat_gw: Still creating... [1m20s elapsed]
aws_nat_gateway.nat_gw: Still creating... [1m30s elapsed]
aws_nat_gateway.nat_gw: Still creating... [1m40s elapsed]
aws_nat_gateway.nat_gw: Still creating... [1m50s elapsed]
aws_nat_gateway.nat_gw: Creation complete after 1m55s [id=nat-088d724c3050c5fd0]
aws_route.private_nat: Creating...
aws_route.private_nat: Creation complete after 1s [id=r-rtb-07b5fcc7598794d5d1080289494]

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.


```
</details>

